; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p1-0 - location
	p1-2 - location
	p1-4 - location
	p2-5 - location
	p3-4 - location
	p5-1 - location
	p5-2 - location
	p5-3 - location
	p5-4 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s3)
	(at driver4 s5)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at package1 s0)
	(at package2 s2)
	(at package3 s4)
	(at package4 s3)
	(at package5 s1)
	(at package6 s2)
	(at package7 s2)
	(at package8 s4)
	(at package9 s5)
	(at package10 s0)
	(at package11 s2)
	(at package12 s1)
	(at package13 s2)
	(at package14 s4)
	(at package15 s5)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 80)
	(= (time-to-walk p0-3 s0) 80)
	(= (time-to-walk s3 p0-3) 17)
	(= (time-to-walk p0-3 s3) 17)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 80)
	(= (time-to-walk p1-0 s1) 80)
	(= (time-to-walk s0 p1-0) 97)
	(= (time-to-walk p1-0 s0) 97)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 56)
	(= (time-to-walk p1-2 s1) 56)
	(= (time-to-walk s2 p1-2) 79)
	(= (time-to-walk p1-2 s2) 79)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 6)
	(= (time-to-walk p1-4 s1) 6)
	(= (time-to-walk s4 p1-4) 37)
	(= (time-to-walk p1-4 s4) 37)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 58)
	(= (time-to-walk p2-5 s2) 58)
	(= (time-to-walk s5 p2-5) 59)
	(= (time-to-walk p2-5 s5) 59)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 32)
	(= (time-to-walk p3-4 s3) 32)
	(= (time-to-walk s4 p3-4) 72)
	(= (time-to-walk p3-4 s4) 72)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 66)
	(= (time-to-walk p5-1 s5) 66)
	(= (time-to-walk s1 p5-1) 38)
	(= (time-to-walk p5-1 s1) 38)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 53)
	(= (time-to-walk p5-3 s5) 53)
	(= (time-to-walk s3 p5-3) 68)
	(= (time-to-walk p5-3 s3) 68)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 79)
	(= (time-to-walk p5-4 s5) 79)
	(= (time-to-walk s4 p5-4) 36)
	(= (time-to-walk p5-4 s4) 36)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 57)
	(= (time-to-drive s3 s0) 57)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 12)
	(= (time-to-drive s5 s0) 12)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 56)
	(= (time-to-drive s2 s1) 56)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 19)
	(= (time-to-drive s4 s1) 19)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 60)
	(= (time-to-drive s0 s2) 60)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 44)
	(= (time-to-drive s4 s3) 44)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 14)
	(= (time-to-drive s0 s4) 14)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 36)
	(= (time-to-drive s1 s5) 36)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 89)
	(= (time-to-drive s3 s5) 89)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 38)
	(= (time-to-drive s4 s5) 38)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s5)
	(at truck2 s2)
	(at truck3 s5)
	(at truck6 s5)
	(at package1 s5)
	(at package2 s4)
	(at package3 s2)
	(at package4 s1)
	(at package5 s5)
	(at package6 s3)
	(at package7 s5)
	(at package8 s4)
	(at package9 s0)
	(at package11 s5)
	(at package12 s1)
	(at package13 s5)
	(at package14 s2)
	(at package15 s4)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 3  (walked))))

)

; plan
1. (load-truck package4 truck1 s3)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   goals met: 3 of 21
2. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 21
3. (walk driver1 s5 p2-5)
   deleted: (at driver1 s5)
   added: (at driver1 p2-5)
   changed: (walked) from 0 to 59
   goals met: 3 of 21
4. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 0 to 44
   goals met: 3 of 21
5. (walk driver1 p2-5 s2)
   deleted: (at driver1 p2-5)
   added: (at driver1 s2)
   changed: (walked) from 59 to 117
   goals met: 3 of 21
6. (load-truck package3 truck1 s4)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 3 of 21
7. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 21
8. (load-truck package14 truck1 s4)
   deleted: (at package14 s4)
   added: (in package14 truck1)
   goals met: 3 of 21
9. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 3 of 21
10. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 3 of 21
11. (load-truck package11 truck3 s2)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   goals met: 3 of 21
12. (load-truck package13 truck3 s2)
   deleted: (at package13 s2)
   added: (in package13 truck3)
   goals met: 3 of 21
13. (drive-truck truck1 s4 s5 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 44 to 82
   goals met: 3 of 21
14. (load-truck package15 truck1 s5)
   deleted: (at package15 s5)
   added: (in package15 truck1)
   goals met: 3 of 21
15. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 82 to 142
   goals met: 3 of 21
16. (drive-truck truck1 s5 s1 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 142 to 178
   goals met: 3 of 21
17. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 3 of 21
18. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 178 to 234
   goals met: 3 of 21
19. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 4 of 21
20. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 4 of 21
21. (walk driver2 s5 p5-1)
   deleted: (at driver2 s5)
   added: (at driver2 p5-1)
   changed: (walked) from 117 to 183
   goals met: 4 of 21
22. (walk driver2 p5-1 s1)
   deleted: (at driver2 p5-1)
   added: (at driver2 s1)
   changed: (walked) from 183 to 221
   goals met: 5 of 21
23. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 234 to 291
   goals met: 5 of 21
24. (unload-truck package14 truck1 s2)
   deleted: (in package14 truck1)
   added: (at package14 s2)
   goals met: 6 of 21
25. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 291 to 380
   goals met: 7 of 21
26. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 8 of 21
27. (unload-truck package7 truck3 s5)
   deleted: (in package7 truck3)
   added: (at package7 s5)
   goals met: 9 of 21
28. (unload-truck package11 truck3 s5)
   deleted: (in package11 truck3)
   added: (at package11 s5)
   goals met: 10 of 21
29. (unload-truck package13 truck3 s5)
   deleted: (in package13 truck3)
   added: (at package13 s5)
   goals met: 11 of 21
30. (drive-truck truck3 s5 s0 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 380 to 392
   goals met: 10 of 21
31. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 392 to 452
   goals met: 10 of 21
32. (drive-truck truck1 s0 s4 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 452 to 466
   goals met: 10 of 21
33. (unload-truck package15 truck1 s4)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   goals met: 11 of 21
34. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 466 to 523
   goals met: 11 of 21
35. (drive-truck truck1 s4 s5 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 523 to 561
   goals met: 11 of 21
36. (load-truck package9 truck1 s5)
   deleted: (at package9 s5)
   added: (in package9 truck1)
   goals met: 11 of 21
37. (walk driver4 s5 p5-4)
   deleted: (at driver4 s5)
   added: (at driver4 p5-4)
   changed: (walked) from 221 to 300
   goals met: 10 of 21
38. (walk driver4 p5-4 s4)
   deleted: (at driver4 p5-4)
   added: (at driver4 s4)
   changed: (walked) from 300 to 336
   goals met: 10 of 21
39. (board-truck driver4 truck2 s4)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 10 of 21
40. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 561 to 650
   goals met: 11 of 21
41. (drive-truck truck2 s4 s5 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (driven) from 650 to 688
   goals met: 11 of 21
42. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 688 to 726
   goals met: 10 of 21
43. (unload-truck package2 truck3 s4)
   deleted: (in package2 truck3)
   added: (at package2 s4)
   goals met: 11 of 21
44. (drive-truck truck3 s4 s3 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 726 to 770
   goals met: 11 of 21
45. (drive-truck truck2 s5 s0 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (driven) from 770 to 782
   goals met: 11 of 21
46. (drive-truck truck2 s0 s2 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 782 to 842
   goals met: 12 of 21
47. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 12 of 21
48. (walk driver4 s2 p2-5)
   deleted: (at driver4 s2)
   added: (at driver4 p2-5)
   changed: (walked) from 336 to 394
   goals met: 12 of 21
49. (walk driver4 p2-5 s5)
   deleted: (at driver4 p2-5)
   added: (at driver4 s5)
   changed: (walked) from 394 to 453
   goals met: 13 of 21
50. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 14 of 21
51. (drive-truck truck1 s5 s3 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 842 to 931
   goals met: 14 of 21
52. (unload-truck package6 truck1 s3)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 15 of 21
53. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (driven) from 931 to 988
   goals met: 15 of 21
54. (unload-truck package9 truck1 s0)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   goals met: 16 of 21
55. (drive-truck truck1 s0 s5 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 988 to 1000
   goals met: 16 of 21
56. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   changed: (walked) from 453 to 459
   goals met: 15 of 21
57. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   changed: (walked) from 459 to 496
   goals met: 15 of 21
58. (board-truck driver2 truck6 s4)
   deleted: (at driver2 s4) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 15 of 21
59. (drive-truck truck6 s4 s1 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (driven) from 1000 to 1019
   goals met: 15 of 21
60. (load-truck package5 truck6 s1)
   deleted: (at package5 s1)
   added: (in package5 truck6)
   goals met: 15 of 21
61. (drive-truck truck6 s1 s5 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   changed: (driven) from 1019 to 1055
   goals met: 16 of 21
62. (unload-truck package5 truck6 s5)
   deleted: (in package5 truck6)
   added: (at package5 s5)
   goals met: 17 of 21
63. (drive-truck truck1 s5 s0 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 1055 to 1067
   goals met: 17 of 21
64. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 18 of 21
65. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 18 of 21
66. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 17 of 21
67. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 1067 to 1156
   goals met: 18 of 21
68. (drive-truck truck6 s5 s1 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   changed: (driven) from 1156 to 1192
   goals met: 17 of 21
69. (drive-truck truck3 s5 s0 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 1192 to 1204
   goals met: 16 of 21
70. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   goals met: 16 of 21
71. (drive-truck truck3 s0 s5 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 1204 to 1216
   goals met: 17 of 21
72. (disembark-truck driver2 truck6 s1)
   deleted: (driving driver2 truck6)
   added: (at driver2 s1) (empty truck6)
   goals met: 18 of 21
73. (drive-truck truck3 s5 s1 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 1216 to 1252
   goals met: 17 of 21
74. (unload-truck package4 truck3 s1)
   deleted: (in package4 truck3)
   added: (at package4 s1)
   goals met: 18 of 21
75. (board-truck driver2 truck6 s1)
   deleted: (at driver2 s1) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 17 of 21
76. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 17 of 21
77. (drive-truck truck6 s1 s5 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   changed: (driven) from 1252 to 1288
   goals met: 18 of 21
78. (disembark-truck driver2 truck6 s5)
   deleted: (driving driver2 truck6)
   added: (at driver2 s5) (empty truck6)
   goals met: 18 of 21
79. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   changed: (walked) from 496 to 502
   goals met: 18 of 21
80. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   changed: (walked) from 502 to 539
   goals met: 18 of 21
81. (walk driver1 s4 p3-4)
   deleted: (at driver1 s4)
   added: (at driver1 p3-4)
   changed: (walked) from 539 to 611
   goals met: 18 of 21
82. (walk driver4 s5 p5-1)
   deleted: (at driver4 s5)
   added: (at driver4 p5-1)
   changed: (walked) from 611 to 677
   goals met: 17 of 21
83. (walk driver1 p3-4 s3)
   deleted: (at driver1 p3-4)
   added: (at driver1 s3)
   changed: (walked) from 677 to 709
   goals met: 18 of 21
84. (walk driver4 p5-1 s1)
   deleted: (at driver4 p5-1)
   added: (at driver4 s1)
   changed: (walked) from 709 to 747
   goals met: 18 of 21
85. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 18 of 21
86. (drive-truck truck3 s1 s5 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 1288 to 1324
   goals met: 19 of 21
87. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 20 of 21
88. (walk driver2 s5 p5-1)
   deleted: (at driver2 s5)
   added: (at driver2 p5-1)
   changed: (walked) from 747 to 813
   goals met: 20 of 21
89. (walk driver2 p5-1 s1)
   deleted: (at driver2 p5-1)
   added: (at driver2 s1)
   changed: (walked) from 813 to 851
   goals met: 21 of 21
